jeeab/t-ui-firmware/sdkconfig.defaults
# CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY is not set
CONFIG_BT_CTRL_DTM_ENABLE=y
CONFIG_BT_CTRL_BLE_MASTER=y
# CONFIG_BT_CTRL_BLE_TEST is not set
CONFIG_BT_CTRL_BLE_SCAN=y
CONFIG_BT_CTRL_BLE_SECURITY_ENABLE=y
CONFIG_BT_CTRL_BLE_ADV=y
# CONFIG_BT_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS is not set

#
# Controller debug log Options (Experimental)
#
# end of Controller debug log Options (Experimental)
# end of Controller Options

#
# Common Options
#
CONFIG_BT_ALARM_MAX_NUM=50
CONFIG_BT_SMP_CRYPTO_STACK_TINYCRYPT=y
# CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS is not set

#
# BLE Log
#
# CONFIG_BLE_LOG_ENABLED is not set
# end of BLE Log

# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# CONFIG_BT_BLE_LOG_UHCI_OUT_ENABLED is not set
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

# CONFIG_BT_HCI_LOG_DEBUG_EN is not set
# end of Bluetooth

CONFIG_BLE_MESH=n
CONFIG_BLE_MESH_HCI_5_0=y
CONFIG_BLE_MESH_V11_SUPPORT=y
# CONFIG_BLE_MESH_RANDOM_ADV_INTERVAL is not set
CONFIG_BLE_MESH_USE_UNIFIED_CRYPTO=y
CONFIG_BLE_MESH_USE_DUPLICATE_SCAN=y
# CONFIG_BLE_MESH_ACTIVE_SCAN is not set
CONFIG_BLE_MESH_MEM_ALLOC_MODE_INTERNAL=y
# CONFIG_BLE_MESH_MEM_ALLOC_MODE_EXTERNAL is not set
# CONFIG_BLE_MESH_MEM_ALLOC_MODE_DEFAULT is not set
CONFIG_BLE_MESH_DEINIT=y

#
# BLE Mesh and BLE coexistence support
#
# CONFIG_BLE_MESH_SUPPORT_BLE_ADV is not set
# CONFIG_BLE_MESH_SUPPORT_BLE_SCAN is not set
# end of BLE Mesh and BLE coexistence support

# CONFIG_BLE_MESH_FAST_PROV is not set
# CONFIG_BLE_MESH_NODE is not set
# CONFIG_BLE_MESH_PROVISIONER is not set
CONFIG_BLE_MESH_PROV=y
CONFIG_BLE_MESH_PROV_EPA=y
# CONFIG_BLE_MESH_CERT_BASED_PROV is not set
CONFIG_BLE_MESH_PB_ADV=y
# CONFIG_BLE_MESH_PB_GATT is not set
CONFIG_BLE_MESH_PROXY=y
# CONFIG_BLE_MESH_GATT_PROXY_CLIENT is not set
CONFIG_BLE_MESH_NET_BUF_POOL_USAGE=y
# CONFIG_BLE_MESH_SETTINGS is not set
CONFIG_BLE_MESH_SUBNET_COUNT=3
CONFIG_BLE_MESH_APP_KEY_COUNT=3
CONFIG_BLE_MESH_MODEL_KEY_COUNT=3
CONFIG_BLE_MESH_MODEL_GROUP_COUNT=3
CONFIG_BLE_MESH_LABEL_COUNT=3
CONFIG_BLE_MESH_CRPL=10
CONFIG_BLE_MESH_MSG_CACHE_SIZE=10
CONFIG_BLE_MESH_ADV_BUF_COUNT=60
CONFIG_BLE_MESH_IVU_DIVIDER=4
# CONFIG_BLE_MESH_IVU_RECOVERY_IVI is not set
# CONFIG_BLE_MESH_SAR_ENHANCEMENT is not set
CONFIG_BLE_MESH_TX_SEG_MSG_COUNT=1
CONFIG_BLE_MESH_RX_SEG_MSG_COUNT=1
CONFIG_BLE_MESH_RX_SDU_MAX=384
CONFIG_BLE_MESH_TX_SEG_MAX=32
# CONFIG_BLE_MESH_FRIEND is not set
# CONFIG_BLE_MESH_NO_LOG is not set

#
# BLE Mesh STACK DEBUG LOG LEVEL
#
# CONFIG_BLE_MESH_TRACE_LEVEL_NONE is not set
# CONFIG_BLE_MESH_TRACE_LEVEL_ERROR is not set
CONFIG_BLE_MESH_TRACE_LEVEL_WARNING=y
# CONFIG_BLE_MESH_TRACE_LEVEL_INFO is not set
# CONFIG_BLE_MESH_TRACE_LEVEL_DEBUG is not set
# CONFIG_BLE_MESH_TRACE_LEVEL_VERBOSE is not set
CONFIG_BLE_MESH_STACK_TRACE_LEVEL=2
# end of BLE Mesh STACK DEBUG LOG LEVEL

#
# BLE Mesh NET BUF DEBUG LOG LEVEL
#
# CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_NONE is not set
# CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_ERROR is not set
CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_WARNING=y
# CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_INFO is not set
# CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_DEBUG is not set
# CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL_VERBOSE is not set
CONFIG_BLE_MESH_NET_BUF_TRACE_LEVEL=2
# end of BLE Mesh NET BUF DEBUG LOG LEVEL

CONFIG_BLE_MESH_CLIENT_MSG_TIMEOUT=4000

#
# Support for BLE Mesh Foundation models
#
# CONFIG_BLE_MESH_CFG_CLI is not set
# CONFIG_BLE_MESH_HEALTH_CLI is not set
CONFIG_BLE_MESH_HEALTH_SRV=y
# CONFIG_BLE_MESH_BRC_CLI is not set
# CONFIG_BLE_MESH_BRC_SRV is not set
# CONFIG_BLE_MESH_PRB_CLI is not set
# CONFIG_BLE_MESH_PRB_SRV is not set
# CONFIG_BLE_MESH_ODP_CLI is not set
# CONFIG_BLE_MESH_SRPL_CLI is not set
# CONFIG_BLE_MESH_AGG_CLI is not set
# CONFIG_BLE_MESH_AGG_SRV is not set
# CONFIG_BLE_MESH_SAR_CLI is not set
# CONFIG_BLE_MESH_SAR_SRV is not set
# CONFIG_BLE_MESH_COMP_DATA_1 is not set
# CONFIG_BLE_MESH_COMP_DATA_128 is not set
# CONFIG_BLE_MESH_MODELS_METADATA_0 is not set
# CONFIG_BLE_MESH_LCD_CLI is not set
# CONFIG_BLE_MESH_LCD_SRV is not set
# CONFIG_BLE_MESH_DF_CLI is not set
# CONFIG_BLE_MESH_DF_SRV is not set
# end of Support for BLE Mesh Foundation models

#
# Support for BLE Mesh Client/Server models
#
# CONFIG_BLE_MESH_GENERIC_ONOFF_CLI is not set
# CONFIG_BLE_MESH_GENERIC_LEVEL_CLI is not set
# CONFIG_BLE_MESH_GENERIC_DEF_TRANS_TIME_CLI is not set
# CONFIG_BLE_MESH_GENERIC_POWER_ONOFF_CLI is not set
# CONFIG_BLE_MESH_GENERIC_POWER_LEVEL_CLI is not set
# CONFIG_BLE_MESH_GENERIC_BATTERY_CLI is not set
# CONFIG_BLE_MESH_GENERIC_LOCATION_CLI is not set
# CONFIG_BLE_MESH_GENERIC_PROPERTY_CLI is not set
# CONFIG_BLE_MESH_SENSOR_CLI is not set
# CONFIG_BLE_MESH_TIME_CLI is not set
# CONFIG_BLE_MESH_SCENE_CLI is not set
# CONFIG_BLE_MESH_SCHEDULER_CLI is not set
# CONFIG_BLE_MESH_LIGHT_LIGHTNESS_CLI is not set
# CONFIG_BLE_MESH_LIGHT_CTL_CLI is not set
# CONFIG_BLE_MESH_LIGHT_HSL_CLI is not set
# CONFIG_BLE_MESH_LIGHT_XYL_CLI is not set
# CONFIG_BLE_MESH_LIGHT_LC_CLI is not set
# CONFIG_BLE_MESH_GENERIC_SERVER is not set
# CONFIG_BLE_MESH_SENSOR_SERVER is not set
# CONFIG_BLE_MESH_TIME_SCENE_SERVER is not set
# CONFIG_BLE_MESH_LIGHTING_SERVER is not set
# CONFIG_BLE_MESH_MBT_CLI is not set
# CONFIG_BLE_MESH_MBT_SRV is not set

#
# Binary Larger Object Transfer model
#
# CONFIG_BLE_MESH_BLOB_SRV is not set
# CONFIG_BLE_MESH_BLOB_CLI is not set
CONFIG_BLE_MESH_BLOB_CHUNK_COUNT_MAX=256
CONFIG_BLE_MESH_ALIGN_CHUNK_SIZE_TO_MAX_SEGMENT=y
# end of Binary Larger Object Transfer model

#
# Device Firmware Update model
#
CONFIG_BLE_MESH_DFU_FWID_MAXLEN=16
CONFIG_BLE_MESH_DFU_METADATA_MAXLEN=32
CONFIG_BLE_MESH_DFU_URI_MAXLEN=32
# CONFIG_BLE_MESH_DFU_SLOTS is not set
# CONFIG_BLE_MESH_DFD_CLI is not set
# end of Device Firmware Update model
# end of Support for BLE Mesh Client/Server models

# CONFIG_BLE_MESH_IV_UPDATE_TEST is not set
CONFIG_BLE_MESH_DISCARD_OLD_SEQ_AUTH=y

#
# BLE Mesh specific test option
#
# CONFIG_BLE_MESH_SELF_TEST is not set
# CONFIG_BLE_MESH_BQB_TEST is not set
# CONFIG_BLE_MESH_SHELL is not set
# CONFIG_BLE_MESH_DEBUG is not set
# end of BLE Mesh specific test option

